# this programs takes csv files from one directory and then process the column names and duplicate values . at the end it creates ID wise seperate csv files in one directoy

In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('smartcity_daily.txt',comment='-',delim_whitespace=True,
            usecols=['INDEX', 'YEAR', 'MN', 'DT', '..MAX', '..MIN', '..R/F'])  #from csv take the columns having name in usecols

In [4]:
df

         INDEX  YEAR  MN  DT  ..MAX  ..MIN  ..R/F
0         5201  1963   8   1   31.2   24.1    NaN
1         5201  1963   8   2   33.7   25.7    NaN
2         5201  1963   8   3   29.4   26.2    NaN
3         5201  1963   8   4   32.2   24.7    NaN
4         5201  1963   8   5   32.7   25.5    NaN
...        ...   ...  ..  ..    ...    ...    ...
2104553  43379  2020   2  25   31.6   24.4    0.0
2104554  43379  2020   2  26   31.8   24.9    0.0
2104555  43379  2020   2  27   31.6   24.0    0.0
2104556  43379  2020   2  28   32.0   24.8    0.0
2104557  43379  2020   2  29   32.0   24.7    0.0

[2104558 rows x 7 columns]

In [5]:
intex = df.INDEX.drop_duplicates().values

In [6]:
intex

array([ 5201,  5216,  5221,  6203,  6206,  7205,  8206, 10201, 10205,
       10207, 14005, 15208, 16201, 42027, 42042, 42055, 42056, 42062,
       42071, 42083, 42099, 42105, 42111, 42137, 42181, 42182, 42187,
       42189, 42220, 42260, 42261, 42262, 42299, 42343, 42348, 42361,
       42366, 42367, 42368, 42369, 42387, 42410, 42451, 42463, 42474,
       42475, 42479, 42483, 42492, 42498, 42516, 42527, 42542, 42543,
       42571, 42623, 42647, 42662, 42667, 42671, 42675, 42700, 42701,
       42724, 42726, 42727, 42737, 42747, 42748, 42751, 42754, 42807,
       42809, 42840, 42866, 42867, 42874, 42875, 42914, 42921, 42937,
       42971, 43005, 43013, 43014, 43063, 43086, 43117, 43149, 43189,
       43192, 43197, 43198, 43258, 43268, 43275, 43278, 43279, 43283,
       43284, 43285, 43295, 43296, 43303, 43319, 43321, 43325, 43328,
       43330, 43331, 43333, 43336, 43337, 43338, 43343, 43344, 43353,
       43359, 43360, 43371, 43372, 43376, 43379], dtype=int64)

In [7]:
df_n = pd.read_excel('sc_name.xls')
df_n = df_n.dropna()

In [8]:
df_n

     St.Index_No.                        Station_Name
2         43063.0                                PUNE
4         43372.0  THIRUVANANTHAPURAM_(A)_(TRIVANDRUM
6         43371.0     THIRUVANANTHAPURAM_(TRIVANDRUM)
8         43353.0                         KOCHI_(NAS)
10        43336.0            KOCHI_A.P.(NEDUMBASSERY)
..            ...                                 ...
246       42055.0                          JAMMU_AERO
248       43605.0                           JAMMU_OLD
250       42027.0                            SRINAGAR
252       42042.0                     SRINAGAR_I.A.F.
254       43540.0                       SRINAGAR(old)

[127 rows x 2 columns]

In [9]:
name = df_n[df_n['St.Index_No.'] == intex[0]]

In [10]:
name

     St.Index_No.   Station_Name
182        5201.0  KANPUR_D.R.L.

In [29]:
for i in range(len(intex)):
    name = df_n[df_n['St.Index_No.']==intex[i]]
    aa   = df[df['INDEX']==intex[i]]

    name = name['Station_Name'].iloc[0].split('(')[0]
    name = name.split('(')[0]
    name = name.split('/')[0]
    name = name.replace(" ", "")
    aa = aa[['YEAR', 'MN', 'DT', '..MAX', '..MIN', '..R/F']]
    aa.columns = ['year','month','date','tmax','tmin','rain']
    aa = aa.reset_index().drop('index',axis=1)
    aa.to_csv('station_files/'+name+'.csv', index=False)